//Комментарии пишутся после (//). Закомментить выделенные строки Ctrl+K+C.
//Console — команда, позволяющая работать с основным окном терминала. Соответственно, мы в него будем какие-то данные выводить, и какие-то данные в нашу программу вносить, путём ввода
//этих данных напрямую в терминале. 
//Сonsole.WriteLine - команда, оператор, выводит текст в терминал и ставит курсор на новую строку. "Текст, который пишется в круглых скобках и двойных кавычках".
//Сonsole.Write - почти то же самое, но в одной строке + артефакт с "%"
//Сonsole.ReаdLine - Именно с её помощью происходит считывание данных. Но эти данные нужно где-то сохранить. Это «где-то» в контексте программирования называется «переменной», для неё
//справедливо понятие — объём занимаемой памяти или «тип данных». Создать некий контейнер (коробку), куда можно положить значения, введённые пользователем.
//string - если данные, которые вводим, строки.
//username.ToLower() - оператор применяется к переменной, все символы в строке переводит в нижний регистр. !!! Учесть референсное значение не "Маша", а "маша"
//int - тип данных для целых чисел (целое число).
//double - контейнер для работы с вещественными числами, дробные с остатком.
//bool - тип данных Истина или Ложь.
//% - логическая опреация как умножение или деление, фиксирует остаток от деления.

// if( УСЛОВИЕ ) 
// {
// Набор действий 1
// }
// else
// {
// Набор действий 2
// }

//new Random().Next(min, max) - "хочу случайное число в диапазоне от Мин до Макс. Генератор случайных чисел от Мин до Макс-1. !!!Само значение Макуимума не входит!
//Дальше даём наименование нашему контейнеру (имя переменной или идентификатора).Назовём username
//формируем приглашение пользователя ко вводу

Console.Write("Введите имя пользователя: ");
string username = Console.ReadLine();

if(username.ToLower() == "маша") //.ToLower() - позволит вводить имя разным регистром и у честь верный результат. !!! Учесть референсное значение не "Маша", а "маша"
{
    Console.WriteLine("Ура, это же МАША!!!");
}
else
{
    Console.Write("Привет, ");
    Console.WriteLine(username);
}