//Комментарии пишутся после (//). Закомментить выделенные строки Ctrl+K+C.
//Console» — это команда, позволяющая работать с основным окном терминала. Соответственно, мы в него будем какие-то данные выводить, и какие-то данные в нашу программу вносить, путём ввода
//этих данных напрямую в терминале. 
//Сonsole.WriteLine - команда, оператор, выводит текст в терминал и ставит курсор на новую строку. "Текст, который пишется в круглых скобках и двойных кавычках".
//Сonsole.Write - почти то же самое, но в одной строке + артефакт с "%"
//Сonsole.ReаdLine - Именно с её помощью происходит считывание данных. Но эти данные нужно где-то сохранить. Это «где-то» в контексте программирования называется «переменной», для неё
//справедливо понятие — объём занимаемой памяти или «тип данных». Создать некий контейнер (коробку), куда можно положить значения, введённые пользователем.
//string - если данные, которые вводим, строки
//Дальше даём наименование нашему контейнеру (имя переменной или идентификатора).Назовём username
Console.Write("Введите ваше имя ");
//формируем приглашение пользователя ко вводу
string username = Console.ReadLine();
//Дальше даём наименование нашему контейнеру (имя переменной или идентификатора). Назовём username. И присвоим ей, то, что просим ввести пользователя
Console.Write("Привет, ");
Console.Write(username);