//Комментарии пишутся после (//). Закомментить выделенные строки Ctrl+K+C.
//Console — команда, позволяющая работать с основным окном терминала. Соответственно, мы в него будем какие-то данные выводить, и какие-то данные в нашу программу вносить, путём ввода
//этих данных напрямую в терминале. 
//Сonsole.WriteLine - команда, оператор, выводит текст в терминал и ставит курсор на новую строку. "Текст, который пишется в круглых скобках и двойных кавычках".
//Сonsole.Write - почти то же самое, но в одной строке + артефакт с "%"
//Сonsole.ReаdLine - Именно с её помощью происходит считывание данных. Но эти данные нужно где-то сохранить. Это «где-то» в контексте программирования называется «переменной», для неё
//справедливо понятие — объём занимаемой памяти или «тип данных». Создать некий контейнер (коробку), куда можно положить значения, введённые пользователем.
//string - если данные, которые вводим, строки.
//username.ToLower() - оператор применяется к переменной, все символы в строке переводит в нижний регистр. !!! Учесть референсное значение не "Маша", а "маша"
//int - тип данных для целых чисел (целое число).
//double - контейнер для работы с вещественными числами, дробные с остатком.
//bool - тип данных Истина или Ложь.
//% - логическая опреация как умножение или деление, фиксирует остаток от деления.
//new Random().Next(min, max) - "хочу случайное число в диапазоне от Мин до Макс. Генератор случайных чисел от Мин до Макс-1. !!!Само значение Макуимума не входит!

// if( УСЛОВИЕ ) 
// {
// Набор действий 1
// }
// else
// {
// Набор действий 2
// }

// while(ЦИКЛ. УСЛОВИЕ ПРОДОЛЖЕНИЯ)
// {
// Набор действий
// }
// int count = 0;
// while( count < 100)
// {
// Набор действий
// count = count + 1
// }

//отчистка консоли Console.Clear();
//Console.SetCursorPosition(10, 4); - для рисования, отступ от Левого и Верхнего края терминала.
//Дальше даём наименование нашему контейнеру (имя переменной или идентификатора).Назовём username.
//формируем приглашение пользователя ко вводу.
// Console.SetCursorPosition(10, 4); //Для рисования, отступ от Левого и Верхнего края терминала
// Console.WriteLine("+"); //морской бой, ставим "+"на 10.4
//count = count + 1, count =+1, count++

Console.Clear();
int xa = 80, ya = 1,
    xb = 1, yb = 20,
    xc = 160, yc = 20;

Console.SetCursorPosition(xa, ya);
Console.WriteLine("+");

Console.SetCursorPosition(xb, yb);
Console.WriteLine("+");

Console.SetCursorPosition(xc, yc);
Console.WriteLine("+");

int x = xa, y = xb;
int count = 0; 
while(count < 10000)
{
    int what = new Random().Next(0, 3); //0 1 2
    if(what == 0)
    {
        x = (x + xa)/2;
        y = (y + ya)/2;
    }
    if(what == 1)
    {
        x = (x + xb)/2;
        y = (y + yb)/2;
    }
    if(what == 2)
    {
        x = (x + xc)/2;
        y = (y + yc)/2;
    }
    Console.SetCursorPosition(x, y);
    Console.WriteLine("+");
    count = count + 1; //count =+1, count++
}