// 1 Группа методов. Ничего не принимают, ничего не возвращают
// void Method1()
// {
//     Console.WriteLine("Автор КАН");
// }
// // как вызываются подобные методы
// Method1(); //идентификатор и круглые скобки




// 2 Группа методов. Что-то принимают, ничего не возвращают
void Method2(string msg)
{
    Console.WriteLine(msg);
}

Method2("Текст сообщения");

//бывают именнованные аргументы, когда мы хотим указать нужному аргументу нужное значение, когда их более 1
void Method21(string msg, int count)
{
    int i = 0;
    while (i < count)
    {
        Console.Writeline();
        count++
    }
}